- It provides tools for data analysis in Python programming language
- DataFrames
- Data Series -- one column or 1 row
- Operations in Pandas
- Mutable, Heterogeneous, Tabular data with labeled axes, 2-dimensional
- Arithmetic operations can be performed

In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'],columns=['Col1','Col2','Col3','Col4'])

In [6]:
df.head()

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [4]:
df.shape

(5, 4)

In [8]:
df.to_csv('testing1')

In [12]:
# Accessing the elements in dataframe

df.loc['Row1']

Col1    0
Col2    1
Col3    2
Col4    3
Name: Row1, dtype: int32

In [13]:
type(df.loc['Row1'])

pandas.core.series.Series

In [16]:
df.iloc[:]

      Col1  Col2  Col3  Col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11
Row4    12    13    14    15
Row5    16    17    18    19

In [19]:
df.iloc[2:3]

      Col1  Col2  Col3  Col4
Row3     8     9    10    11

In [20]:
df.iloc[:].values # converting dataframess to arrays

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [23]:
df.isnull().sum()

Col1    0
Col2    0
Col3    0
Col4    0
dtype: int64

In [24]:
df['Col2'].value_counts()

Col2
1     1
5     1
9     1
13    1
17    1
Name: count, dtype: int64

In [26]:
df['Col1'].unique()

array([ 0,  4,  8, 12, 16])

In [32]:
df[['Col3','Col1']] # defined as a list to retrieve more than 1 column values

      Col3  Col1
Row1     2     0
Row2     6     4
Row3    10     8
Row4    14    12
Row5    18    16